import AboutUs from '../components/AboutUs'
import styles from '../css/mainAbout.module.css'
import { useLanguage } from '../components/LanguageContext';

const MainAbout = () => {

  const { language } = useLanguage();

  return (
    <div className={styles.mainAbout}>
      <div className={styles.container}>
        <div className={styles.aboutTitle}>
          <h1 className={styles.aboutTtl}>ЭнергоЛиб</h1>
        </div>
        <div className={styles.aboutDescription}>
          <div style={{ borderTop: '1px solid #ffffff', width: '1320px', marginTop: '60px' }}></div>
          <p className={styles.description}>
            {language === 'ru' 
            ? 'Онлайн библиотека нашего колледжа — это уникальное пространство, где каждый студент и преподаватель может найти необходимые знания и материалы для учебы, научной работы и саморазвития. Мы стремимся создать условия, в которых информация становится доступной для всех, независимо от времени или местоположения. Наша библиотека открыта 24/7, что позволяет вам изучать материалы, делать заметки и готовиться к экзаменам в любое удобное время.'
            : 'Біздің колледждің онлайн кітапханасы әрбір студент пен оқытушы оқуға, ғылыми жұмысқа және өзін-өзі дамытуға қажетті білім мен материалдарды таба алатын бірегей кеңістік. Біз уақытқа немесе орынға қарамастан ақпарат барлығына қолжетімді болатын жағдайларды жасауға тырысамыз. Біздің кітапхана 24/7 ашық, бұл сізге материалдарды үйренуге, жазбалар алуға және кез-келген уақытта емтиханға дайындалуға мүмкіндік береді.'}
          </p>
        </div>

        <div className={styles.aboutTitle}>
          <h1 className={styles.aboutTtl}>
            {language === 'ru' ? 'Наша миссия' : 'Біздің миссия'}
          </h1>
        </div>
        <div className={styles.aboutDescription}>
          <div style={{ borderTop: '1px solid #ffffff', width: '1320px', marginTop: '60px' }}></div>
          <p className={styles.description}>
            {language === 'ru' 
            ? 'Наша библиотека убеждена, что знания — это ключ к будущему. Мы стремимся создать доступное пространство для студентов и преподавателей, обеспечивая легкий доступ к ресурсам для обучения и саморазвития. '
            : 'Біздің кітапхана білім болашақтың кілті екеніне сенімді. Біз оқу және өзін-өзі дамыту ресурстарына оңай қол жеткізуді қамтамасыз ете отырып, студенттер мен оқытушылар үшін қолжетімді кеңістік құруға тырысамыз.'}
            <br />
            <br />
            {language === 'ru' 
            ? 'Мы нацелены на вдохновение пользователей к новым открытиям и поддерживаем их в обучении. Мы создаем комфортные условия для раскрытия потенциала каждого и стремимся быть надежным партнером на вашем образовательном пути, улучшая наши услуги и расширяя коллекцию. Наша миссия — помогать вам достигать целей и расти как личность.'
            : 'Біз пайдаланушыларды жаңа ашылуларға шабыттандыруға және оларды оқытуда қолдауға бағытталғанбыз. Біз әркімнің әлеуетін ашу үшін қолайлы жағдай жасаймыз және қызметтерімізді жақсарту және коллекцияны кеңейту арқылы білім беру жолында сенімді серіктес болуға тырысамыз. Біздің міндетіміз — мақсаттарға жетуге және тұлға ретінде өсуге көмектесу.'}
          </p>
        </div>

        <div className={styles.aboutTitle}>
          <h1 className={styles.aboutTtl}>
            {language === 'ru' ? 'О нашей команде' : 'Біздің команда'}
          </h1>
        </div>
        <div className={styles.aboutDescription}>
          <div style={{ borderTop: '1px solid #ffffff', width: '1320px', marginTop: '60px' }}></div>
          <p className={styles.description}>
              {language === 'ru' 
              ? 'Команда нашей библиотеки — это специалисты, которые поддерживают работу системы, обновляют коллекцию книг и помогают пользователям решать технические вопросы. Мы всегда готовы ответить на ваши вопросы и помочь в использовании платформы.' 
              : 'Біздің кітапхананың командасы-бұл жүйені қолдайтын, кітаптар жинағын жаңартатын және пайдаланушыларға техникалық мәселелерді шешуге көмектесетін мамандар. Біз әрқашан сіздің сұрақтарыңызға жауап беруге және платформаны пайдалануға көмектесуге дайынбыз.'}
          </p>
        </div>
        <AboutUs />
      </div>
    </div>
  );
};

export default MainAbout;
